Step 1:Configure the Tunnel 0 interface of RA.
  Enter into the configuration mode for RA Tunnel 0.
      RA(config)# interface tunnel 0
  Set the IP address as indicated in the Addressing Table.
      RA(config-if)# ip address 10.10.10.1 255.255.255.252
  Set the source and destination for the endpoints of Tunnel 0.
      RA(config-if)# tunnel source s0/0/0
      RA(config-if)# tunnel destination 209.165.122.2
  Configure Tunnel 0 to convey IP traffic over GRE.
      RA(config-if)# tunnel mode gre ip
  The Tunnel 0 interface should already be active. In the event that it is not, treat it like any other interface.
      RA(config-if)# no shutdown
Step 2:Configure the Tunnel 0 interface of RB.
Step 3:Configure a route for private IP traffic.
  Establish a route between the 192.168.X.X networks using the 10.10.10.0/30 network as the destination.
      RA(config)# ip route 192.168.2.0 255.255.255.0 10.10.10.2
      RB(config)# ip route 192.168.1.0 255.255.255.0 10.10.10.1
Step 4: Verification
      show ip interface brief
      show interface tunnel 0
